[
    {
        "id": 1,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Tính toán chiều cao vật thể từ mô hình bề mặt số tính toán từ ảnh ghép chụp từ máy bay không người lái (drone)",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, ThSKH, ThSKT, VB2",
        "Số SV": "Không xác định",
        "Chi tiết": "Ảnh chụp từ máy bay không người lái (drone) có rất nhiều ứng dụng trong thực tế. Một trong các ứng dụng thực tế là khi bay drone chụp nhiều ảnh với tỷ lệ chồng lên nhau lớn (70-80%) cho phép ghép nhiều ảnh nhỏ thành một ảnh khu vực lớn, phục vụ cho bài toán quy hoạch cũng như phân lớp các đối tượng trên mặt đất. Bên cạnh ảnh ghép, một sản phẩm đầu ra của bài toán này là dữ liệu mô hình bề mặt số (Digital Surface Model), cho biết cao độ của từng điểm ảnh tương ứng. Từ những dữ liệu mô hình bề mặt số này có thể trích xuất được độ cao của từng vật thể tương ứng, từ đó áp dụng cho các bài toán như phân đoạn ảnh, đo thể tích các tòa nhà hay đo sinh khối của một khu rừng Yêu cầu đặt ra với đề tài này là việc tính toán chính xác độ cao của từng vật thể (ứng với từng điểm ảnh) để từ đó áp dụng vào các bài toán tương ứng. Để thực hiện việc này có thể áp dụng nhiều giải pháp khác nhau, từ áp dụng các kỹ thuật thuật toán thông thường đến sử dụng các mô hình học sâu như các mô hình Diffusion để dự đoán mô hình mặt đất số hoặc dự đoán trực tiếp độ cao từng điểm ảnh. Các kết quả hoàn thiện sẽ được công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 2,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Sử dụng ảnh vệ tinh tần suất lớn (Himawari-8 10 phút/ảnh) để đánh giá mức độ ảnh hưởng của đảo nhiệt lên các thành phố ở Việt Nam",
        "Loại đề tài": "TTTN, ĐAMH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, ThSKH, ThSKT",
        "Số SV": "2",
        "Chi tiết": "Trong các vệ tinh viễn thám, vệ tinh địa tĩnh với vị trí cố định so với trái đất cho phép thu nhận dữ liệu liên tục với tần suất lớn (nhiều lần/giờ), cho phép triển khai các nghiên cứu trước đây chưa làm được. Một trong những vệ tinh viễn thám địa tĩnh thông dụng hiện nay là vệ tinh Himawari-8 với tần suất thu nhận ảnh là 10 phút/ảnh. Đồng thời vệ tinh này thu nhận dữ liệu trên nhiều dải tần khác nhau như ảnh màu RGB, ảnh cận nhiệt và ảnh tầm nhiệt. Với các dữ liệu tầm nhiệt cho phép thu nhận nhiệt độ trên mặt đất cho phép thực hiện các bài toán liên quan. Một trong những vấn đề lớn với các quốc gia là hiện tượng đảo nhiệt, khi nhiệt độ ở trong thành phố có có sự chênh lệch so với ở khu vực ngoại ô do sự phát triển của các công trình xây dựng cũng như hoạt động của con người (phương tiện giao thông, điều hòa). Tại Việt Nam, mặc dù tác động của đảo nhiệt là khá rõ ràng nhưng việc có các nghiên cứu đánh giá đầy đủ về mức độ tăng nhiệt độ trong khu vực đô thị và ngoại ô cũng như tác động của quá trình đô thị hóa là chưa đầy đủ. Một trong những hạn chế của các nghiên cứu hiện tại là chưa đánh giá được sự chênh lệch nhiệt độ trong những giai đoạn thời tiết khắc nghiệt (như đợt nắng nóng hay đợt gió mùa) để đánh giá sự sai khác. Việc sử dụng dữ liệu nhiệt Himawari-8 cho phép thực hiện được việc này một cách chính xác và đầy đủ. Yêu cầu đặt ra là phải cần giải quyết là tính toán nhiệt độ trên bề mặt từ dữ liệu tầm nhiệt, giám sát nhiệt độ liên tục, lọc nhiễu (thường gây ra do mây mù hay bầu khí quyển). Nhiệm vụ tiếp theo là phát hiện các giai đoạn thời tiết khắc nghiệt (qua việc lọc giai đoạn) và từ đó đánh giá mức độ ảnh hưởng của đảo nhiệt lên nhiệt độ đô thị và ngoại ô Việt Nam. Kết quả đề tài hoàn thiện sẽ được công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 3,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Đánh giá ảnh hưởng của góc chiếu mặt trời lên sinh trưởng của rừng nhiệt đới Đông Nam Á sử dụng ảnh vệ tinh MODIS",
        "Loại đề tài": "ĐATN",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, KSCQ, ThSKH, ThSKT",
        "Số SV": "1",
        "Chi tiết": "Xử lý ảnh viễn thám (phần lớn là ảnh vệ tinh) là một trong những lĩnh vực kết hợp giữa xử lý ảnh (image processing) và hệ thống thông tin địa lý (Geographic Information System) giúp giải quyết các vấn đề trên mặt đất ở diện rộng mà thông thường rất khó có thể đánh giá toàn diện nếu chỉ dựa vào các dữ liệu đơn lẻ trên mặt đất. Các ứng dụng có thể giải quyết bằng xử lý ảnh viễn thám rất đa dạng, từ đánh giá sự thay đổi phân bố trên bề mặt nhất là các thành phố, phát hiện rác thải nhựa trên mặt nước, đánh giá mức độ phủ của rừng cũng như phát hiện phá rừng, theo dõi và đánh giá sự thay đổi nhiệt độ bề mặt cùng ảnh hưởng của nó đến sức khỏe con người, giám sát sự phát triển của cây xanh và phát hiện các yếu tố bất thường như dịch bệnh, hoặc thậm chí có thể phát hiện các thành phần khoáng sản trong đất đai. Yêu cầu cụ thể đối với đề tài đồ án tốt nghiệp này như sau: - Yêu cầu sinh viên: cần có kiến thức về xử lý ảnh. Nếu đã từng làm việc qua đồ án môn học hoặc các môn project về xử lý ảnh viễn thám giúp tiết kiệm thời gian. - Sinh viên cần xử lý ảnh vệ tinh MODIS về cây xanh cũng như các dữ liệu MODIS về thông số mô hình hóa BRDF. - Sinh viên cần đánh giá sự thay đổi góc chiếu theo mùa phụ thuộc vào kinh độ và vĩ độ - Sinh viên cần nghiên cứu và thực hiện thuật toán (công thức) để chuẩn hóa dữ liệu MODIS về cùng một góc chiếu sử dụng thông số mô hình hóa BRDF. Sau đó đánh giá sự sai khác dữ liệu chưa chuẩn hóa và đã chuẩn hóa góc chiếu. - Từ đó, đánh giá sự sai khác dữ liệu này ảnh hưởng thế nào đến sự thay đổi tín hiệu của rừng nhiệt đới theo mùa và theo năm, cũng như các tham số sinh học trích chọn từ dữ liệu theo mùa này. - Kết quả đề tài tốt có thể thực hiện công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 4,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu ảnh hưởng và chuẩn hóa góc chiếu mặt trời và vệ tinh đến việc thu nhận dữ liệu giữa ảnh vệ tinh MODIS/VIIRS và ảnh vệ tinh địa tĩnh Himawari-8",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, ThSKH, ThSKT",
        "Số SV": "3",
        "Chi tiết": "Trong thị giác máy tính, việc thu nhận ảnh của cùng một đối tượng có thể khác nhau tùy thuộc vào góc chiếu giữa đối tượng, nguồn sáng và cảm biến (máy ảnh) thu nhận. Đối với ảnh thu nhận từ vệ tinh, việc thu nhận ảnh cũng gặp vấn đề tương tự, nhất là với đối tượng được thu nhận dài hạn (theo mùa, theo năm, theo nhiều năm) như đo sự sinh trưởng rừng, lúa, cây nông nghiệp. Vị trí của mặt trời (nguồn sáng) thay đổi theo mùa, vị trí của vệ tinh cũng không phải cố định trên bầu trời. Do đó việc đánh giá sự thay đổi đối tượng theo thời gian là sự tổng hòa giữa sự thay đổi thực sự của đối tượng (như khi lúa sinh trưởng, phát triển, trổ bông,…) và sự thay đổi do sự thay đổi mặt trời theo mùa. Việc đánh giá, chuẩn hóa dữ liệu này vô cùng quan trọng nhằm loại bỏ sự tác động của sự thay đổi góc chiếu và đánh giá chính xác sự thay đổi theo thời gian của đối tượng. Ngoài ra, việc này còn giúp kết hợp dữ liệu giữa các vệ tinh với nhau, do mỗi vệ tinh thường chỉ có thời hạn hoạt động khoảng 7-10 năm. Muốn đánh giá sự thay đổi của đối tượng qua nhiều thập kỷ cần sự kết hợp của nhiều loại vệ tinh với các thiết kế về góc chiếu khác nhau. Trong bài toán này, nhiệm vụ chính là đánh giá tác động của góc chiếu đến việc thu nhận thông tin giữa ảnh MODIS và ảnh VIIRS (vốn được thiết kế để thay thế cho MODIS). Do 2 vệ tinh không hoàn toàn giống nhau nên tác động của góc chiếu lên các chỉ số cây xanh (được tính từ ảnh thô để đo sinh trưởng của cây xanh) cũng sẽ khác nhau. Khi đó, việc đánh giá tác động của góc chiếu lên dữ liệu ảnh MODIS và VIIRS là cần thiết để từ đó đưa ra được sai số cũng như kết hợp, tiếp nối việc thám sát cùng đối tượng được đồng nhất. Kết quả đề tài hoàn thiện sẽ được công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 5,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Sử dụng ảnh vệ tinh tần suất lớn (Himawari-8 10 phút/ảnh) để giám sát nhiệt độ bề mặt và phát hiện bất thường về nhiệt độ",
        "Loại đề tài": "ĐATN",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, KSCQ, ThSKH, ThSKT",
        "Số SV": "2",
        "Chi tiết": "Trong các vệ tinh viễn thám, vệ tinh địa tĩnh với vị trí cố định so với trái đất cho phép thu nhận dữ liệu liên tục với tần suất lớn (nhiều lần/giờ), cho phép triển khai các nghiên cứu trước đây chưa làm được. Một trong những vệ tinh viễn thám địa tĩnh thông dụng hiện nay là vệ tinh Himawari-8 với tần suất thu nhận ảnh là 10 phút/ảnh. Đồng thời vệ tinh này thu nhận dữ liệu trên nhiều dải tần khác nhau như ảnh màu RGB, ảnh cận nhiệt và ảnh tầm nhiệt. Với các dữ liệu tầm nhiệt cho phép thu nhận nhiệt độ trên mặt đất cho phép thực hiện các bài toán liên quan. Một trong những ứng dụng quan trọng của dữ liệu nhiệt của Himawari-8 là việc phát hiện bất thường về nhiệt độ, đóng vai trò quan trọng trong việc phát hiện cháy gần thời gian thực. Yêu cầu đặt ra là phải cần giải quyết là tính toán nhiệt độ trên bề mặt từ dữ liệu tầm nhiệt, giám sát nhiệt độ liên tục, lọc nhiễu (thường gây ra do mây mù hay bầu khí quyển) và đưa ra cảnh báo khi có tăng nhiệt đột ngột. Ngoài ra, việc giám sát dữ liệu định kỳ hàng năm cũng có thể đưa ra cảnh báo về khả năng gây cháy khi mức nhiệt hiện tại cao hơn so với hàng năm. Kết quả đề tài hoàn thiện sẽ được công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 28,
        "Tên giảng viên": "Bành Thị Quỳnh Mai",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Mạng cảm biến không dây",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Thu thập, đo đạc dữ liệu mạng cảm biến không dây WSN, tối ưu hoá hoạt động mạng cảm biến không dây trong IoT"
    },
    {
        "id": 29,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nén video ngữ nghĩa dùng mô hình CNN và ứng dụng (Semantic Video Compression using CNN and applications)",
        "Loại đề tài": "ĐATN, ĐAMH",
        "Hệ": "ThSKH, CNTH, KSCQ, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 30,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nhận dạng cảm xúc dùng mô hình hợp nhất đa thể thức và kỹ thuật học sâu (Emotion Recognition Using Multimodal Fusion Models and Deep Learning)",
        "Loại đề tài": "ĐATN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, KSCQ, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 31,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện và theo dõi người/ đối tượng chuyển động trong video (Motion Human/ Object Detection and Tracking in video)",
        "Loại đề tài": "ĐATN, ĐAMH",
        "Hệ": "ThSKH, CNTH, VB2, CNKT, KSCQ, KSTN, CTTT, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 32,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển các ứng dụng thị giác máy tính và AI (Developed applications for Computer Vision and AI))",
        "Loại đề tài": "ĐATN, ĐAMH",
        "Hệ": "ThSKH, CNTH, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 33,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nén ảnh/ video với kỹ thuật học sâu - CNN (Image and Video Compression with Deep Learning - CNN)",
        "Loại đề tài": "ĐATN, ĐAMH",
        "Hệ": "ThSKH, CNTH, CNKT, KSCQ, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 34,
        "Tên giảng viên": "Nguyễn Thị Hoàng Lan",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển các ứng dụng công nghệ Web (Website, Web applications)",
        "Loại đề tài": "ĐATN, ĐAMH",
        "Hệ": "CNTH, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 64,
        "Tên giảng viên": "Trần Quang Đức",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu, phát triển hệ thống hỗ trợ truyền dòng theo thời gian thực trong môi trường mạng Internet",
        "Loại đề tài": "ĐATN",
        "Hệ": "KSCQ",
        "Số SV": "2",
        "Chi tiết": "Nghiên cứu, phát triển hệ thống hỗ trợ truyền dòng theo thời gian thực trong môi trường mạng Internet"
    },
    {
        "id": 65,
        "Tên giảng viên": "Trần Quang Đức",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng, phát triển hệ thống phát hiện DGA dựa trên phân tích đặc điểm hành vi mã độc",
        "Loại đề tài": "ĐATN",
        "Hệ": "Không xác định",
        "Số SV": "2",
        "Chi tiết": "Xây dựng, phát triển hệ thống phát hiện mã độc DGA dựa trên phân tích đặc điểm hành vi"
    },
    {
        "id": 73,
        "Tên giảng viên": "Trần Hải Anh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng Federated Learning vào xử lý tính toán biên (edge computing) để giải quyết các bài toán liên quan đến BioInformatics trong mạng SDN phân tán",
        "Loại đề tài": "ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Ứng dụng xử lý tính toán biên đã mang lại rất nhiều lợi ích cho việc giải quyết các bài toán BioInformatics như: giảm độ trễ, tăng độ riêng tư, cải thiện khả năng co giãn, và yêu cầu giảm băng thông. Việc áp dụng AI vào giải quyết các bài toán BioInformatics đã trở thành xu thế tất yếu, tuy nhiên, thực hiện huấn luyện đơn lẻ ở các miền độc lập ở biên mạng trở nên không hiệu quả. Federated Learning là một giải pháp tiềm năng cho vấn đề này. Đề tài hướng đến ứng dụng FL vào xử lý tính toán biên (edge computing) để giải quyết các bài toán liên quan đến BioInformatics trong mạng SDN phân tán."
    },
    {
        "id": 74,
        "Tên giảng viên": "Trần Hải Anh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng Transfer Learning vào giải quyết bài toán dự đoán ma trận lưu lượng cho mạng SDN phân tán",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH",
        "Hệ": "ThSKH, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "5",
        "Chi tiết": "Ma trận lưu lượng (MTLL) biểu diễn thông tin về lưu lượng và sự phân bố các luồng lưu lượng bên trong hệ thống mạng. MTLL đóng một vai trò quan trọng trong nhiều lĩnh vực quản trị mạng, vd: hạch toán lưu lượng, lập lịch hoặc định tuyến lại lưu lượng trong thời gian ngắn, thiết kế mạng, phát hiện bất thường, v.v... Do đó, việc dự đoán MTLL chính xác là điều cần thiết để xử lý sớm các tác vụ đó một cách hiệu quả. May mắn thay, Trí tuệ nhân tạo (AI) đã và đang phát triển rất mạnh mẽ nhờ sự phát triển của công nghệ máy tính như GPU và TPU. Điều đó mang lại cơ hội ứng dụng AI vào các phương pháp dự đoán MTLL. Tuy nhiên, việc áp dụng các kỹ thuật Học máy trong các mạng truyền thống gặp phải một số vấn đề do điều khiển phân tán và tầm điều khiển cục bộ của các nút mạng bị hạn chế. Kiến trúc điều khiển tập trung của Mạng khả trình (Software-defined Network - SDN), là một giải pháp đầy hứa hẹn. Tuy nhiên, việc áp dụng các kỹ thuật học máy (Machine Learning - ML) cho một mạng SDN phân tán trở nên phức tạp với quá trình huấn luyện diễn ra phân tán ở nhiều miền SDN. Từ đó, đề tài hướng đến ứng dụng kỹ thuật Học chuyển giao (Transfer Learning) để có thể truyền tri thức từ những miền đã được huấn luyện tới những miền mới và ít dữ liệu. Từ đó, mỗi miền có thể xây dựng thành công những mô hình dự đoán MTLL với độ chính xác cao."
    },
    {
        "id": 75,
        "Tên giảng viên": "Trần Hải Anh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng trang web thương mại điện tử",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "5",
        "Chi tiết": "Trong thời kỳ chuyển đổi số đang ngày càng phát triển với quy mô rộng khắp, việc thiết kế và xây dựng các hệ thống thương mại điện tử trở nên rất cần thiết. Đề tài giúp sinh viên rèn luyện các kỹ năng phân tích thiết kế hệ thống và phát triển một hệ thống thương mại điện tử có khả năng được ứng dụng."
    },
    {
        "id": 81,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng giải pháp quản lí mạng trong mạng thế hệ mới",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Không xác định",
        "Số SV": "3",
        "Chi tiết": "Việc quản lí mạng đóng vai trò quan trọng đối với các nhà mạng (Vietel, VNPT, v.v.). Một trong số đó là bài toán định tuyến nhằm tối ưu hiệu năng của hệ thống mạng về băng thông, độ mất mát gói tin. Tuy nhiên, các giải pháp truyền thống thông qua việc tìm đường đi ngắn nhất lại không hiệu quả, đặc biệt là trong mạng thế hệ mới như ngày nay. Mục tiêu của đồ án là xây dựng một thuật toán định tuyến nhằm tối ưu hiệu năng mạng trong mạng thế hệ mới. Thông qua đồ án này, sinh viên sẽ có thêm kiến thức và kĩ năng về mạng thế hệ mới (cấu hình, triển khai) cũng như các kĩ năng đọc báo cáo, làm việc nhóm. Ngoài ra sinh viên còn có cơ hội tham gia viết bài báo nghiên cứu khoa học nếu thu được kết quả tốt."
    },
    {
        "id": 82,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện lỗ hổng trong smart contract của Blockchain sử dụng mã nguồn",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Không xác định",
        "Số SV": "3",
        "Chi tiết": "Nhắc tới tiền ảo thì chúng ta thường hay nghĩ tới Bitcoin hay Ether. Các loại tiền ảo này được tạo ra nhờ công nghệ Blockchain. Ngoài ứng dụng về tiền ảo, Blockchain còn có một ứng dụng nổi bật khác là smart contact, ứng dụng cung cấp các hợp đồng cho bên mua và bên bán mà không cần thông qua bên trung gian. Smart contract được viết bởi các ngôn ngữ lập trình (Solidity, Python, v.v) nên rất dễ tồn tại những lỗ hổng. Bên cạnh đó, người tham gia vào mạng Blockchain rất đa dạng nên sẽ có những kẻ xấu muốn lợi dụng lỗ hổng trong các smart contract để trục lợi. Ví dụ, Ethereum đã mất hơn 60 triệu đô la Mỹ năm 2016 vì bị kẻ xấu lợi dụng lỗ hổng reentrancy để trục lợi. Tương tự như vậy, trong năm 2017, một lỗ hổng khác bị khai thác làm cho Ethereum thiệt hại hơn 280 triệu đô la Mỹ. Vì vậy, việc phát hiện lỗ hổng trong smart contract đóng vai trò rất quan trọng tron Blockchain. Trong quá khứ, đã có rất nhiều công cụ phát hiện lỗ hổng trong smart contract được phát triển như Oyente, Mythril, Dedaub, v.v. Tuy nhiên, thời gian xử lí của các công cụ này lớn trong khi độ chính xác chưa được tốt. Do đó, rất nhiều nghiên cứu đã tập trung vào giải pháp tự động phát hiện lỗ hổng trong smart contract sử dụng mã nguồn của smart contract và thuật toán học sâu (Deep Learning). Giải pháp này sẽ phân tích mã nguồn của smart contract để trích rút ra các đặc trưng ngữ nghĩa và cú pháp, từ đó phân tích các đặc trưng này sử dụng thuật toán học sâu để tự động xác định các kiểu lỗ hổng. Mục tiêu của đồ án là xây dựng một giải pháp tự động phát hiện lỗ hổng cho các smart contract trong các sàn tiền ảo hay các ứng dụng triển khai dựa vào Blockchain. Thông qua đồ án này, sinh viên sẽ có thêm kiến thức và kĩ năng về thuật toán học sâu cũng như các kĩ năng đọc báo cáo, làm việc nhóm. Ngoài ra sinh viên còn có cơ hội tham gia viết bài báo nghiên cứu khoa học nếu thu được kết quả tốt."
    },
    {
        "id": 83,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển giải pháp hỗ trợ sửa lỗi tự động trong mã nguồn sử dụng mô hình ngôn ngữ lớn.",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, CNKT, KSCQ, SIE, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Các sản phẩm phần mềm ngày nay thường được viết bằng các ngôn ngữ lập trình. Trong quá trình phát triển phần mềm, mặc dù các kiểm thử viên đã kiểm tra mã nguồn kĩ càng nhưng đôi khi vẫn bỏ sót một số lỗi hay lỗ hổng, việc này có thể dẫn đến nhiều tổn thất to lớn đối với các doanh nghiệp. Ngày nay, đã có rất nhiều giải pháp phát hiện lỗi hay lỗ hổng tự động. Tuy nhiên, việc gợi ý để vá lối hay lỗ hổng lại chưa được quan tâm đầy đủ. Đề tài này phát triển giải pháp hỗ trợ sửa lỗi tự động trong mã nguồn sử dụng mô hình ngôn ngữ lớn."
    },
    {
        "id": 84,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phân loại lưu lượng mạng mã hóa cho các nhà mạng",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Không xác định",
        "Số SV": "3",
        "Chi tiết": "Phân loại lưu lượng mạng đóng vai trò quan trọng trong việc quản lí mạng cho các nhà cung cấp dịch vụ mạng (Vietel, VNPT, v.v.). Mục đích của việc phân loại lưu lượng mạng là để xác định các kiểu ứng dụng ứng với các luồng lưu lượng mạng (truyền video, truyền file, VoIP, v.v), từ đó triển khai các giải pháp thích nghi cho từng kiểu ứng dụng này và đáp ứng các yêu cầu khác nhau của người dùng. Ví dụ, các cơ chế định tuyến hướng ứng dụng nhằm tối ưu các tham số mạng theo yêu cầu của người dùng (độ trễ, độ mất mát gói tin, băng thông, v.v), hệ thống phát hiện xâm nhập, chặn các luồng lưu lượng mạng theo yêu cầu của các cơ quan, v.v. Mục tiêu của đồ án là xây dựng một giải pháp phân loại lưu lượng mạng mã hóa cho các nhà cung cấp dịch vụ mạng sử dụng thuật toán học sâu (Deep Learning). Thông qua đồ án này, sinh viên sẽ có thêm kiến thức và kĩ năng về thuật toán học sâu cũng như các kĩ năng đọc báo cáo, làm việc nhóm. Ngoài ra sinh viên còn có cơ hội tham gia viết bài báo nghiên cứu khoa học nếu thu được kết quả tốt."
    },
    {
        "id": 85,
        "Tên giảng viên": "Đỗ Công Thuần",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển các hệ thống nhúng/IoT",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 86,
        "Tên giảng viên": "Đỗ Công Thuần",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu về CPU hiệu năng cao (Proposing techniques for high-performance CPUs)",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 87,
        "Tên giảng viên": "Đỗ Công Thuần",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu tối ưu thuật toán trên GPU với CUDA (Algorithm optimization for GPUs using CUDA)",
        "Loại đề tài": "ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 88,
        "Tên giảng viên": "Đỗ Công Thuần",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu các mô hình AI phù hợp cho các hệ thống IoT (AI models for IoT-based system)",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "ThSKH, CNTH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 91,
        "Tên giảng viên": "Nguyễn Linh Giang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phương pháp học tăng cường và áp dụng giải quyết các bài toán trong lĩnh vực mạng truyền thông và an toàn thông tin",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "2-3",
        "Chi tiết": "Mục tiêu: Nghiên cứu tìm hiểu phương pháp học máy, học tăng cường. Áp dụng vào giải quyết các bài toán tối ưu, những bài toán quyết định có tính Markov. Nội dung: - Nghiên cứu các phương pháp học máy; - Nghiên cứu các quá trình quyết định Markov, phương pháp học tăng cường, và xấp xỉ ngẫu nhiên; - Áp dụng giải quyết các bài toán quyết định trong lĩnh vực mạng truyền thông và an toàn thông tin như giải quyết các bài toán tối ưu trong mạng, phát hiện tấn công mạng qua quan sát hành vi, ... - Lập trình: python, C, ..."
    },
    {
        "id": 92,
        "Tên giảng viên": "Nguyễn Linh Giang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện tấn công mạng bằng phát hiện bất thường dựa trên phân tích dữ liệu",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "2-3",
        "Chi tiết": "Mục tiêu: sử dụng các phương pháp học máy (machine learning) trong phát hiện bất thường trong dữ liệu mạng. Nội dung: - Nghiên cứu, thử nghiệm các phương pháp học máy; - Nghiên cứu, thử nghiệm các phương pháp phân tích dữ liệu, trích chọn đặc trưng của tấn công mạng dựa vào phân tích dữ liệu, các phương pháp học sâu; - Phát triển thử nghiệm hệ thống phát hiện tấn công mạng. Tập trung vào phát hiện Botnet, phát hiện tấn công DDoS, phát hiện tấn công vào hệ thống web. Ngôn ngữ lập trình: Python, C, C++, Java, PHP"
    },
    {
        "id": 93,
        "Tên giảng viên": "Nguyễn Linh Giang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Bảo mật dữ liệu cho giao tiếp device to device, IoT",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, KSCQ, SIE, KSTN, CTTT, KSCLC, ThSKT, HEDSPI",
        "Số SV": "3-4",
        "Chi tiết": "Mục tiêu: tìm hiểu, nghiên cứu và phát triển các phương pháp bảo vệ dữ liệu cho giao tiếp M2M. Nội dung: - NGhiên cứu, tìm hiểu, thử nghiệm các phương pháp đảm bảo kết nối an toàn trong giao tiếp M2M trong các hệ thống IoT. - Nghiên cứu các phương pháp cấp phát chứng thư số, mã hoá nhẹ trong môi trường tính toán giới hạn. - Phát triển thử nghiệm hệ thống cấp phát chứng thư số và sử dụng ký số, bảo mật dựa trên các thuật toán mã hoá hạng nhẹ;"
    },
    {
        "id": 94,
        "Tên giảng viên": "Nguyễn Linh Giang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện và xử lý tấn công từ chối dịch vụ",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "2-3",
        "Chi tiết": "Mục tiêu: Tìm, phát hiện, theo dõi tác nhân gây ra tấn công từ chối dịch vụ DDoS bằng phương pháp học máy và phân tích dữ liệu. Nội dung: - Nghiên cứu, thử nghiệm các phương pháp học máy, trích chọn đặc trưng; - Nghiên cứu các phương pháp học sâu, - Phân tích đặc trưng của các dạng tấn công qua Botnet theo các các luồng dữ liệu mạng - Nghiên cứu và phân tích đặc điểm của các dạng Botnet DGA - NGhiên cứu các giải pháp giảm thiểu ảnh hưởng tấn công qua Botnet - Phát triển hệ thống phát hiện Botnet và giảm ảnh hưởng của Botnet Ngôn ngữ lập trình: Python, C, C++, Java, ..."
    },
    {
        "id": 101,
        "Tên giảng viên": "Trịnh Văn Chiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng lý thuyết tối ưu hóa cho truyền thông và mạng",
        "Loại đề tài": "ĐATN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, LATS, ThSKH, ThSKT",
        "Số SV": "5",
        "Chi tiết": "Phân bổ tài nguyên là một vấn đề cơ bản và quan trọng đối với các mạng không dây để đảm bảo mạng hoạt động hiệu quả và ổn định. Đặc biệt, trong mạng 5G và mạng 6G, nhiều nhu cầu dịch vụ mạng không dây khác nhau sẽ được yêu cầu. Đề tài này,nghiên cứu về lĩnh vực phân bổ tài nguyên trong mạng truyền thông 5G/6G. Đề tài đưa ra một cái nhìn tổng quan về vấn đề phân bổ tài nguyên trong các mạng không dây hiện nay và xem xét các phương pháp phân bổ tài nguyên dựa vào lý thuyết tối ưu hóa."
    },
    {
        "id": 102,
        "Tên giảng viên": "Trịnh Văn Chiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng khoa học dữ liệu cho truyền thông và mạng",
        "Loại đề tài": "ĐATN, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, LATS, ThSKH, ThSKT",
        "Số SV": "5",
        "Chi tiết": "Khoa học dữ liệu đã và đang được nghiên cứu rộng rãi. Truyền thông ngữ nghĩa gần đây được ứng dụng như một bước đột phá vượt ra ngoài định lý Shannon bằng cách truyền và nhận thông tin ngữ nghĩa thay vì các bit dữ liệu hoặc ký hiệu không quan tâm nội dung của nó. Đề tài này ứng dụng khoa học dữ liệu và truyền thông ngữ nghĩa để tăng hiệu suất truyền dẫn của hệ thống. Dữ liệu ở đây có thể là ảnh, video, hoặc văn bản."
    },
    {
        "id": 103,
        "Tên giảng viên": "Trịnh Văn Chiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng trí tuệ nhân tạo, xử lý tín hiệu và cơ sở dữ liệu cho các thiết bị IoT",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, HEDSPI, CN, CNKH, CNTH, KSCQ, IPE, LATS, ThSKH, ThSKT",
        "Số SV": "5",
        "Chi tiết": "Ứng dụng trí tuệ nhân tạo, xử lý tín hiệu, và cơ sở dữ liệu trong hệ thống thiết bị IoT có thể mang lại nhiều lợi ích, từ tối ưu hóa hiệu suất đến cải thiện khả năng dự đoán và quản lý dữ liệu. Đề tài định hướng ứng dụng, nhưng nếu sinh viên có kết quả mới, sáng tạo sẽ được hỗ trợ định hướng nghiên cứu."
    },
    {
        "id": 104,
        "Tên giảng viên": "Trịnh Văn Chiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Bảo mật trong mạng 5G/6G",
        "Loại đề tài": "ĐATN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, LATS, ThSKH, ThSKT",
        "Số SV": "5",
        "Chi tiết": "Lớp vật lý có vai trò quan trọng trong bảo mật của mạng không dây do tiềm năng cung cấp các giải pháp hiệu quả hơn để bảo vệ quyền riêng tư cho các mạng 5G cũng như cá thê hệ mạng tiếp theo. Các kỹ thuật bảo mật lớp vật lý bổ sung các tính năng mạnh mẽ có thể nâng cao các cơ chế dựa trên mật mã, bằng cách xem xét các thuộc tính của kênh vô tuyến. Mặc dù bảo mật lớp vật lý đã được nghiên cứu kỹ lưỡng trong thập kỷ qua, các kịch bản mới được mong đợi cho các mạng trong tương lai đặt ra những thách thức lớn đối với việc chấp nhận đầy đủ các kỹ thuật bảo mật lớp vật lý như một thành phần của các giải pháp bảo mật của mạng viễn thông tương lai. Đề tài này nghiên cứu các nguyên tắc cơ bản về lý thuyết thông tin của các chỉ số bảo mật ở lớp vật lý."
    },
    {
        "id": 105,
        "Tên giảng viên": "Nguyễn Kim Khánh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng hệ sinh thái dựa trên kiến trúc RISC-V",
        "Loại đề tài": "ĐATN",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 106,
        "Tên giảng viên": "Nguyễn Kim Khánh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Tìm hiểu kiến trúc RISC-V và các kit phát triển",
        "Loại đề tài": "ĐAMH",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": ""
    },
    {
        "id": 147,
        "Tên giảng viên": "Bành Thị Quỳnh Mai",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Quản trị mạng",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Quản trị mạng doanh nghiệp vừa và nhỏ"
    },
    {
        "id": 157,
        "Tên giảng viên": "Trần Hoàng Hải",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu về ứng dụng các mô hình AI cho các bài toán bảo mật",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "3",
        "Chi tiết": "Tìm hiểu các mô hình AI cơ bản. Tìm hiểu các bộ dữ liệu tương ứng với nhiều bài toán bảo mật. Xây dựng mô hình, triển khai, kiểm thử Định hướng: Sinh viên sẽ có 1 kết quả là 1 bài báo Scopus, đồng hướng dẫn với Gs nước ngoài và có nhiều cơ hội lấy học bổng đi học SĐH."
    },
    {
        "id": 158,
        "Tên giảng viên": "Trần Hoàng Hải",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu về các vấn đề trong An ninh Mạng (Network Security), tập trung vào các kỹ thuật phát hiện xâm nhập",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "4",
        "Chi tiết": "- Tìm hiểu về An ninh Mạng, Network Intrusion Detection System - Tìm hiểu các kỹ thuật phát hiện xâm nhập Signature-based, Anomaly Detection - Ứng dụng các công cụ phân tích và xử lý dữ liệu tăng tốc độ xử lý dữ liệu cho N-IDS - Tham gia xây dựng platform về phát hiện tấn công mạng Định hướng: Sinh viên sẽ có 1 kết quả là 1 bài báo Scopus, đồng hướng dẫn với Gs nước ngoài và có nhiều cơ hội lấy học bổng đi học SĐH."
    },
    {
        "id": 159,
        "Tên giảng viên": "Trần Hoàng Hải",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Bài toán tối ưu cho phân phối tài nguyên mạng",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "3",
        "Chi tiết": "Định hướng: Sinh viên được học cách làm nghiên cứu, đồng hướng dẫn với Gs nước ngoài và có nhiều cơ hội lấy học bổng đi học SĐH."
    },
    {
        "id": 160,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Sử dụng ảnh vệ tinh Landsat/Sentinel-2/MODIS để tính và đánh giá sự thay đổi bề mặt theo thời gian",
        "Loại đề tài": "TT, TTTN, ĐAMH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, KSCQ",
        "Số SV": "5",
        "Chi tiết": "Xử lý ảnh viễn thám (phần lớn là ảnh vệ tinh) là một trong những lĩnh vực kết hợp giữa xử lý ảnh (image processing) và hệ thống thông tin địa lý (Geographic Information System) giúp giải quyết các vấn đề trên mặt đất ở diện rộng mà thông thường rất khó có thể đánh giá toàn diện nếu chỉ dựa vào các dữ liệu đơn lẻ trên mặt đất. Với các nước phát triển, đây là một lĩnh vực được chú trọng phát triển cả ở các cơ quan nhà nước và doanh nghiệp tư nhân. Tại Việt Nam, đây là một lĩnh vực còn khá mới nhưng đã được quan tâm phát triển trong một vài năm gần đây như việc phóng vệ tinh VINASAT hay thành lập Trung tâm Vũ trụ Việt, cùng với sự quan tâm của một số doanh nghiệp lớn như Viettel. Các ứng dụng có thể giải quyết bằng xử lý ảnh viễn thám rất đa dạng, từ đánh giá sự thay đổi phân bố trên bề mặt nhất là các thành phố, phát hiện rác thải nhựa trên mặt nước, đánh giá mức độ phủ của rừng cũng như phát hiện phá rừng, theo dõi và đánh giá sự thay đổi nhiệt độ bề mặt cùng ảnh hưởng của nó đến sức khỏe con người, giám sát sự phát triển của cây xanh và phát hiện các yếu tố bất thường như dịch bệnh, hoặc thậm chí có thể phát hiện các thành phần khoáng sản trong đất đai. Qua đề tài này, sinh viên sẽ nắm được các vấn đề cơ bản trong việc xử lý và ứng dụng ảnh viễn thám vào một ứng dụng cụ thể ở mức đơn giản, bao gồm các nội dung chính sau: - Hiểu về đặc thù của ảnh viễn thám, bên cạnh ma trận ảnh là thông tin về kinh độ/vĩ độ của từng điểm ảnh cũng như hệ tọa độ chiếu lên mặt đất. - Cách tải và tiền xử lý các dữ liệu ảnh nén từ các cơ quan vũ trụ như NASA (Hoa Kỳ), hay ESA (Châu Âu) - Hiển thị các dữ liệu ảnh đã tiền xử lý để kiểm tra và đánh giá bằng phần mềm/ngôn ngữ liên quan (QGIS/ Python) - Cách sử dụng công cụ để xử lý (như Python hay Google Earth Engine) và phân tích dữ liệu (R, Python) ảnh để đạt được kết quả mong muốn. - Yêu cầu chung với sinh viên: là sinh viên năm thứ 3 trở đi có mong muốn học về xử lý ảnh (thị giác máy tính) và/hoặc trí tuệ nhân tạo. - Đối với đề tài “Sử dụng ảnh vệ tinh Landsat/Sentinel-2 để tính và đánh giá sự thay đổi bề mặt các thành phố theo thời gian”, sinh viên sẽ được tiếp cận một trong các dữ liệu vệ tinh như Landsat-8 (30-m, 16 ngày/ ảnh), Sentinel-2 (10-m, 6 ngày/ảnh) hay MODIS VI (250-m, 16 ngày/ảnh). - Mục tiêu chính là sinh viên qua xử lý có thể thấy được sự thay đổi mật độ cây xanh/ mặt nước giảm do sự phát triển xây dựng các đô thị, cơ sở hạ tầng (như đường sắt). Một hướng tiếp cận khác của đề tài là đánh giá mức độ phủ của rừng theo thời gian. Ngoài ra, sinh viên có thể đánh giá thêm sự thay đổi nhiệt độ liên quan đến sự thay đổi hạ tầng."
    },
    {
        "id": 161,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu ảnh hưởng và chuẩn hóa góc chiếu mặt trời và vệ tinh đến việc thu nhận dữ liệu giữa ảnh vệ tinh MODIS và VIIRS",
        "Loại đề tài": "TT, ĐATN, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, IPE, ThSKH, ThSKT",
        "Số SV": "2",
        "Chi tiết": "Trong thị giác máy tính, việc thu nhận ảnh của cùng một đối tượng có thể khác nhau tùy thuộc vào góc chiếu giữa đối tượng, nguồn sáng và cảm biến (máy ảnh) thu nhận. Đối với ảnh thu nhận từ vệ tinh, việc thu nhận ảnh cũng gặp vấn đề tương tự, nhất là với đối tượng được thu nhận dài hạn (theo mùa, theo năm, theo nhiều năm) như đo sự sinh trưởng rừng, lúa, cây nông nghiệp. Vị trí của mặt trời (nguồn sáng) thay đổi theo mùa, vị trí của vệ tinh cũng không phải cố định trên bầu trời. Do đó việc đánh giá sự thay đổi đối tượng theo thời gian là sự tổng hòa giữa sự thay đổi thực sự của đối tượng (như khi lúa sinh trưởng, phát triển, trổ bông,…) và sự thay đổi do sự thay đổi mặt trời theo mùa. Việc đánh giá, chuẩn hóa dữ liệu này vô cùng quan trọng nhằm loại bỏ sự tác động của sự thay đổi góc chiếu và đánh giá chính xác sự thay đổi theo thời gian của đối tượng. Ngoài ra, việc này còn giúp kết hợp dữ liệu giữa các vệ tinh với nhau, do mỗi vệ tinh thường chỉ có thời hạn hoạt động khoảng 7-10 năm. Muốn đánh giá sự thay đổi của đối tượng qua nhiều thập kỷ cần sự kết hợp của nhiều loại vệ tinh với các thiết kế về góc chiếu khác nhau. Trong bài toán này, nhiệm vụ chính là đánh giá tác động của góc chiếu đến việc thu nhận thông tin giữa ảnh MODIS và ảnh VIIRS (vốn được thiết kế để thay thế cho MODIS). Do 2 vệ tinh không hoàn toàn giống nhau nên tác động của góc chiếu lên các chỉ số cây xanh (được tính từ ảnh thô để đo sinh trưởng của cây xanh) cũng sẽ khác nhau. Khi đó, việc đánh giá tác động của góc chiếu lên dữ liệu ảnh MODIS và VIIRS là cần thiết để từ đó đưa ra được sai số cũng như kết hợp, tiếp nối việc thám sát cùng đối tượng được đồng nhất. Kết quả đề tài hoàn thiện sẽ được công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 162,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Sử dụng ảnh vệ tinh Landsat/Sentinel-2 để đánh giá sự thay đổi bề mặt các thành phố theo thời gian và ảnh hưởng đến nhiệt độ bề mặt",
        "Loại đề tài": "ĐATN",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, KSCQ, ThSKH, ThSKT",
        "Số SV": "2",
        "Chi tiết": "Xử lý ảnh viễn thám (phần lớn là ảnh vệ tinh) là một trong những lĩnh vực kết hợp giữa xử lý ảnh (image processing) và hệ thống thông tin địa lý (Geographic Information System) giúp giải quyết các vấn đề trên mặt đất ở diện rộng mà thông thường rất khó có thể đánh giá toàn diện nếu chỉ dựa vào các dữ liệu đơn lẻ trên mặt đất. Các ứng dụng có thể giải quyết bằng xử lý ảnh viễn thám rất đa dạng, từ đánh giá sự thay đổi phân bố trên bề mặt nhất là các thành phố, phát hiện rác thải nhựa trên mặt nước, đánh giá mức độ phủ của rừng cũng như phát hiện phá rừng, theo dõi và đánh giá sự thay đổi nhiệt độ bề mặt cùng ảnh hưởng của nó đến sức khỏe con người, giám sát sự phát triển của cây xanh và phát hiện các yếu tố bất thường như dịch bệnh, hoặc thậm chí có thể phát hiện các thành phần khoáng sản trong đất đai. Yêu cầu cụ thể đối với đề tài đồ án tốt nghiệp này như sau: - Yêu cầu sinh viên: cần có kiến thức về xử lý ảnh. Nếu đã từng làm việc qua đồ án môn học hoặc các môn project về xử lý ảnh viễn thám giúp tiết kiệm thời gian. - Sinh viên cần có/ học kỹ năng xử lý ảnh vệ tinh Landsat-8 (30-m, 16 ngày/ ảnh), Sentinel-2 (10-m, 6 ngày/ảnh) và MODIS (250-m, 16 ngày/ảnh). - Sinh viên cần phân tích sự thay đổi bề mặt bằng việc phân loại bề mặt của 1 trong các thành phố lớn ở Việt Nam (Hà Nội hay TP Hồ Chí Minh) theo thời gian. Việc phân loại có thể dựa vào phân loại truyền thống hoặc sử dụng các kỹ thuật học máy, học sâu. - Đánh giá sự thay đổi nhiệt độ chung và vấn đề đảo nhiệt (so sánh nhiệt độ nội đô và vùng nông thôn) do sự phát triển của đô thị đã xét đến ở trên. - Phân tích sự thay đổi nhiệt độ giữa các khu vực khác nhau trong thành phố (nhiều cây xanh, ít cây xanh, mật độ xây dựng, …) - Kết quả đề tài tốt có thể thực hiện công bố lên các tạp chí khoa học liên quan."
    },
    {
        "id": 163,
        "Tên giảng viên": "Trần Nguyên Ngọc",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phân loại bề mặt của ảnh vệ tinh/drone bằng các kỹ thuật học sâu",
        "Loại đề tài": "TT, TTTN, ĐAMH, SV NCKH",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ, VLVH, VB2",
        "Số SV": "3",
        "Chi tiết": "Một trong những ứng dụng của học máy/ học sâu là áp dụng để phân loại các ảnh bề mặt được chụp bởi vệ tinh hay các máy bay không người lái. Việc phân loại gặp phải các vấn đề cần giải quyết như cường độ sáng khác nhau với cùng vật thể (vd: bóng râm và ngoài nắng) hay các vấn đề che khuất vật thể (cây cối che các tòa nhà). Những trở ngại này có thể được khắc phục bằng việc áp dụng các thuật toán học sâu để giải quyết vấn đề, tăng cường độ chính xác của bài toán."
    },
    {
        "id": 111,
        "Tên giảng viên": "Nguyễn Thị Thanh Nga",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Đề tài thuộc nhóm ứng dụng web",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNTH, KSCQ, SIE, CTTT, CNKH, Viet-Phap, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 111,
        "Tên giảng viên": "Đoàn Phong Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Optimal Transport Based Distance For Sequential Data",
        "Loại đề tài": "Không xác định",
        "Hệ": "KSCQ, KSTN, CTTT",
        "Số SV": "2",
        "Chi tiết": "Measuring the distance between data sequences is a challenging problem. Existing methods typically align the two sequences before calculating their distance based on the difference between corresponding elements. However, the alignments induced by these methods are usually not flexible enough to accommodate local distortions, transition and most of them lack a mechanism to remove outliers. This project aims to propose novel method for measuring the distance between two data sequences that alleviate the aforementioned issues. The project mainly bases on optimal transport framework, which now draws a vast attention from research community due to its nice properties. Then, the project studies applications of the proposed distances on several tasks such as time-series classification, step-localization, etc"
    },
    {
        "id": 113,
        "Tên giảng viên": "Đoàn Phong Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Structured Optimal Transport",
        "Loại đề tài": "Không xác định",
        "Hệ": "KSCQ, KSTN, CTTT",
        "Số SV": "Không xác định",
        "Chi tiết": "Optimal transport (OT) aligns samples across distributions by minimizing the transportation cost between them, e.g., the geometric distances. However, it ignores coherence structure in the data such as clusters, does not handle outliers well, and cannot integrate new data points. This project aims to address these drawbacks. Many approaches can be considered. For example, the information measures between two domains, which well explain matching between structures, are potential alternative costs. Well-designed regularizations are also good choices for preserving structures when aligning the distributions. Then, the project will apply the proposed OT-based variants to many applications, such as image-to-image matching, image-to-text matching, domain adaptation, etc.,"
    },
    {
        "id": 114,
        "Tên giảng viên": "Bùi Trọng Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Building an IDS on ICS /OT networks",
        "Loại đề tài": "Không xác định",
        "Hệ": "CTTT",
        "Số SV": "Không xác định",
        "Chi tiết": "Learning and deploying Zeek/BroIDS products - Building rulesets and attack detection modules - Building local control and operation programs - Building a central management system Requirements for students: - Have basic knowledge of computer networks - Have the ability to program the Web"
    },
    {
        "id": 114,
        "Tên giảng viên": "Bùi Trọng Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Tìm hiểu về mật mã hậu lượng tử",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNTH, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": " Tìm hiểu chung về các thuật toán mật mã hậu lượng tử (post quantum cryptography) - Tìm hiểu về các mô hình đóng gói khóa, chữ ký số sử dụng mật mã hậu lượng tử - Thử nghiệm sử dụng các thuật toán với thư viện Bouncy Castle - Yêu cầu: sinh viên có kiến thức cơ bản về mật mã học, lập trình Java"
    },
    {
        "id": 114,
        "Tên giảng viên": "Bùi Trọng Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng hệ thống quản lý an toàn an ninh thông tin",
        "Loại đề tài": "Không xác định",
        "Hệ": "Viet-Phap, KSCLC, KSTN, CTTT, SIE, HEDSPI, CN, CNKH, CNKT, CNTH, KSCQ",
        "Số SV": "Không xác định",
        "Chi tiết": "- Tìm hiểu mô hình hệ thống SIEM - Cài đặt, triển khai và khảo sát hệ thống ELK - Khảo sát các chức năng của hệ thống - Phát triển các tính năng cho hệ thống"
    },
    {
        "id": 114,
        "Tên giảng viên": "Bùi Trọng Tùng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng ứng dụng mã hóa đầu cuối",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "- Tìm hiểu các giao thức mã hóa đầu cuối - Thiết kế và phát triển mô-đun mã hóa đầu cuối cho các ứng dụng truyền tin - Yêu cầu: sinh viên có kiến thức căn bản về mật mã học"
    },
    {
        "id": 115,
        "Tên giảng viên": "Hoàng Văn Hiệp",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Hệ thống giám sát xe chuyên dùng của ngân hàng (Xe chở tiền)",
        "Loại đề tài": "Không xác định",
        "Hệ": "KSCQ",
        "Số SV": "Không xác định",
        "Chi tiết": "Các ngân hàng ở VN có lượng lưu chuyển tiền mặt hàng ngày rất lớn: chuyển tiền từ kho/quỹ đến các phòng giao dịch, hoặc đến các cây ATM. Để vận chuyển tiền, ngân hàng dùng các xe chở tiền chuyên dụng, trên xe có các thành viên tổ điều chuyển bao gồm: lái xe, chủ hàng, kỹ thuật viên ATM, và công an. Nhu cầu đặt ra là cần giám sát hoạt động của các xe chở tiền này --> Hệ thống giám sát bao gồm thiết bị phần cứng lắp trên xe và hệ thống phần mềm trên server."
    },
    {
        "id": 115,
        "Tên giảng viên": "Hoàng Văn Hiệp",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phân lớp các bộ phá sóng GPS",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH",
        "Số SV": "Không xác định",
        "Chi tiết": "Áp dụng các kỹ thuật xử lý tín hiệu số để làm bài toán: phát hiện, phân loại các thiết bị phá sóng GPS trên thị trường. Hiện nay, rất nhiều lái xe kinh doanh vận tải có xu hướng sử dụng các bộ phá sóng GPS để vô hiệu hóa hộp đen lắp đặt trên xe (hộp đen là bắt buộc với xe kinh doanh vận tải) ==> nhà quản lý không có dữ liệu định vị của xe dẫn đến không thể áp dụng các chế tài ==> Cần có phương pháp phát hiện nhanh tài xế có dùng bộ phá sóng hay không"
    },
    {
        "id": 115,
        "Tên giảng viên": "Hoàng Văn Hiệp",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Bộ thu mềm cho tín hiệu NaVIC",
        "Loại đề tài": "Không xác định",
        "Hệ": "ĐATN",
        "Số SV": "Không xác định",
        "Chi tiết": "Tìm hiểu giải mã tín hiệu định vị của hệ thống NaVIC, xây dựng bộ thu mềm cho tín hiệu này."
    },
    {
        "id": 116,
        "Tên giảng viên": "Phạm Huy Hoàng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Chuyển đổi IPv4 sang IPv6",
        "Loại đề tài": "Không xác định",
        "Hệ": "ĐATN",
        "Số SV": "Không xác định",
        "Chi tiết": "Tìm hiểu các chiến lược chuyển đổi hệ thống từ IPv4 lên IPv6 và cài đặt thử nghiệm, đánh giá ưu nhược điểm của các phương án chuyển đổi"
    },
    {
        "id": 116,
        "Tên giảng viên": "Phạm Huy Hoàng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Mạng thế hệ mới SDN và thử nghiệm multicast",
        "Loại đề tài": "Không xác định",
        "Hệ": "ĐATN",
        "Số SV": "Không xác định",
        "Chi tiết": "- Tìm hiểu mô hình SDN - Cài đặt giả lập mạng SDN với Mininet. - Cài đặt Controller OpenDaylight - Cài đặt ứng dụng giao tiếp với các switch SDN qua OpenDaylight để triển khai bài toán multicast trên mạng giả lập này và đo đạc các thông số lưu lượng"
    },
    {
        "id": 116,
        "Tên giảng viên": "Phạm Huy Hoàng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng các module Web hỗ trợ học online với XBlock",
        "Loại đề tài": "Không xác định",
        "Hệ": "TT, ĐATN, TTTN, ĐAMH",
        "Số SV": "Không xác định",
        "Chi tiết": "XBlock được open edX (project xây dựng platform học online của các trường đại học Mỹ như MIT, Burkeley, Stanford, v.v..) đưa ra nhằm mục địch chuẩn hóa modul xây dựng học liệu cho các hệ thống học online. Hiện tại XBlock đang được nhiều hệ thống học online sử dụng như https://www.edx.org/ hay ngay tại HUST/SoICT: https://daotao.ai XBlock cho phép tạo ra nhiều loại dữ liệu phục vụ đào tạo online, như là nhúng câu hỏi vào video, tự động kiểm tra thiết kế mạch điện đúng, hay tự động kiểm tra code chương trình đúng, v.v.. . Đề tài này yêu cầu sinh viên tìm hiểu kiến trúc XBlock trong kiến trúc tổng thể open edX và xây dựng các module XBlock hỗ trợ các dạng học liệu mới. Link tham khảo: - Giới thiệu về XBlock: https://docs.huihoo.com/edx/open-edx-xblock-tutorial/overview/introduction.html#overview - XBlock tutorial: https://docs.huihoo.com/edx/open-edx-xblock-tutorial/index.html - XBlock Courseware Components: https://github.com/edx/XBlock/blob/master/README.rst"
    },
    {
        "id": 116,
        "Tên giảng viên": "Phạm Huy Hoàng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Load balancing cho hệ thống MOOC",
        "Loại đề tài": "Không xác định",
        "Hệ": "TT, ĐATN, TTTN, ĐAMH",
        "Số SV": "Không xác định",
        "Chi tiết": "Hệ thống hỗ trợ học online cỡ lớn (MOOC - Massive Open Online Courses) cho phép nhiều trường đại học cùng tham gia và chia sẻ khóa học. Tham khảo hệ thống MOOC của các trường đại học Mỹ: https://www.edx.org/ HUST/SoICT đang xây dựng hệ thống MOOC (https://daotao.ai) và sẽ mở cho các trường khác tham gia. Với số lượng tham gia nhiều, bài toán cân bằng tải cần được nghiên cứu xử lý cho hệ thống này. Link tham khảo: - open edX: https://readthedocs.org/projects/edx-installing-configuring-and-running/downloads/pdf/latest/ - cân bằng tải cho open edX: https://blog.lawrencemcdaniel.com/scaling-open-edx/"
    },
    {
        "id": 117,
        "Tên giảng viên": "Nguyễn Đình Thuận",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng hệ thống lập trình online CodeRunner",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Xây dựng hệ thống lập trình online CodeRunner"
    },
    {
        "id": 117,
        "Tên giảng viên": "Nguyễn Đình Thuận",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển hệ thống mô phỏng tín hiệu định vị vệ tinh dựa trên công nghệ SDR",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, SIE, KSTN, CTTT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 118,
        "Tên giảng viên": "Nguyễn Đình Thuận",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Hệ thống khuếch đại âm thanh",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 118,
        "Tên giảng viên": "Lã Thế Vinh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng học mấy để nâng cao chất lượng hình ảnh phục vụ công tác điều tra",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Trong công tác nghiệp vụ điều tra, rất nhiều tình huống mà thông tin đến từ các ảnh thu thập hiện trường có chất lượng rất kém. Do đó mục tiêu của đề tài này hướng đến việc ứng dụng các mạng học sâu như SRGAN, REAL-ESRGAN để có thể nâng cao chất lượng của các hình ảnh này đến mức có thể truy xuất được các thông tin hữu ích. Một số kỹ thuật thường dùng: - Ổn định khung hình - Chiếu phối cảnh hình ảnh - Trung bình frame để tăng độ phân giải - Tăng độ phân giải bằng học sâu (SRGAN, ESRGAN...)"
    },
    {
        "id": 118,
        "Tên giảng viên": "Lã Thế Vinh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phối hợp thị giác máy tính để hỗ trợ hệ thống định vị dẫn đường dùng vệ tinh",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Sử dụng các phương pháp thị giác máy tính để trích trọn các đặc trưng chuyển động từ camera (sự thay đổi góc hướng, tốc độ) sau đó tích hợp các thông tin này vào trong lọc Kalman của phương trình tọa độ từ dữ liệu vệ tinh định vị. Sự kết hợp này sẽ cải thiện kết quả định vị. Hệ thống kết hợp này có tính khả thi cao đặc biệt cho các phương tiện ô-tô cá nhân khi mà camera và thiết bị định vị đều đã có sẵn. Sự kết hợp của camera-gnss sẽ tạo ra hệ thống định vị có tính chính xác và ổn định hơn đặc biệt khi di chuyển vào khu vực nhiều tòa nhà, công trình chắn sóng từ vệ tinh định vị."
    },
    {
        "id": 118,
        "Tên giảng viên": "Lã Thế Vinh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển hệ thống truy xuất chứng cứ từ thiết bị lưu trữ",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Trong nghiệp vụ điều tra tội phạm, nhu cầu trích xuất dữ liệu từ các ổ lưu trữ lấy được trong quá trình điều tra là rất lớn. Tuy nhiên việc sao chép dữ liệu không được phép tạo ra bất kỳ thay đổi nào trên ổ gốc. Do đó thông thường các hệ thống sao chép cần thực hiện một số thay đổi trong hệ điều hành để tránh việc ổ gốc có thể bị ghi (do hệ điều hành, do các chương trình scan virus, hoặc do người dùng vô tình thao tác sai). Việc sao chép được thực hiện ở mức sector của ổ lưu trữ (ví dụ lệnh dd trên linux). Trong đồ án này sinh viên cần: - Tìm hiểu về hệ điều hành Kali Linux - Sử dụng các tiện ích của Kali Linux để tạo ra một hệ thống chống thay đổi ổ đĩa - Kết hợp các ổ đĩa RAID để sao chép đồng thời - Phát triển phần mềm sao chép ở mức sector"
    },
    {
        "id": 119,
        "Tên giảng viên": "Trương Thị Diệu Linh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển hệ thống truy xuất chứng cứ từ thiết bị lưu trữ",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, SIE, KSTN, CTTT, KSCLC, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Hiện nay ngày càng có nhiều hộ gia đình trồng cây cảnh trong chậu trên ban công cho nhu cầu giải trí. Tuy vậy, mỗi khi đi du lịch hoặc đi vắng một thời gian, chủ nhà lại phải tính toán các giải pháp tưới cho các cây này. Có một số hệ thống đã có trên thị trường tuy nhiên khi triển khai lại gặp vấn đề khó khăn, ví dụ khả năng tưới tự động kém, khả năng điều chỉnh lượng tưới thấp, khả năng điều khiển từ xa kém, bắt buộc phải có nguồn nước, nguồn điện ở ban công v.v... Nhiệm vụ của đồ án là đưa ra và triển khai giải pháp phù hợp. - Xây dựng mô hình - Xây dựng server (dự kiến sử dụng NodeJS) - Xây dựng ứng dụng client (trên nền Arduino)"
    },
    {
        "id": 119,
        "Tên giảng viên": "Trương Thị Diệu Linh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Thiết kế mạng quang không dây tầm cao",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, SIE, KSTN, CTTT, KSCLC, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Truyền thông quang không dây - Free Space Optics (FSO) sử dụng sóng ánh sáng lan truyền trong không gian để truyền dữ liệu. Thiết bị thu phát FSO thương mại đã được sử dụng để truyền dữ liệu giữa các điểm gần nhau trên mặt đất ở tốc độ 1-2 Gbps. Trong mô hình mạng 6G, FSO được đề xuất sử dụng để giao tiếp giữa các vệ tinh, giữa các thiết bị bay tầm cao HAP (high-altitude platform) ở độ cao trên 22 km. Ở độ cao này, các kết nối FSO khá phù hợp với mạng 6G do ít chịu ảnh hưởng của các yếu tố thời tiết và do đó có thể truyền dữ liệu vẫn với tốc độ hàng Gbps cho mỗi bước sóng nhưng ở khoảng cách rất xa đến 100 km. FSO cũng đã và đang được các tập đoàn lớn như Facebook, Google, Thales nghiên cứu để sử dụng cho cả các kết nối giữa HAP và mặt đất. Kết nối FSO sẽ cho tốc độ truyền dữ liệu cao hơn rất nhiều so với các hình thức kết nối bằng tần số Radio đang được sử dụng rộng rãi hiện nay. Mặc dù vậy, việc sử dụng FSO cho kết nối từ vệ tinh, HAP tới mặt đất vẫn còn là vấn đề mở do sự ảnh hưởng của các yếu tố thời tiết như mây, sương đến tính sẵn sàng của kết nối. Ngoài ra, một vấn đề cần nghiên cứu nữa là thiết kế mạng lưới các HAP, các thiết bị FSO như thế nào để có thể đáp ứng hết nhu cầu truyền tải dữ liệu giữa các trạm mặt đất trong khuôn khổ năng lượng hạn chế của các thiết bị bay tầm cao. Đề tài này tập trung vào vấn đề: - Thiết kế mạng luới HAP sao cho có thể bao phủ hết các FSO dưới mặt đất với chi phí nhỏ nhất có thể trong khung cảnh nhiều ràng buộc vật lý. - Xác định mô hình FSO tối ưu trên các HAP. Tài liệu tham khảo: Dieu Linh Truong, Xuan Vuong Dang, The Ngoc Dang, Survivable free space optical mesh network using high-altitude platforms, Optical Switching and Networking, 2022, 100716, ISSN 1573-4277, https://doi.org/10.1016/j.osn.2022.100716. Nhiệm vụ: - Tìm hiểu nghiên cứu đã có - Cải tiến và cài đặt và thử nghiệm thuật toán cải tiến. Yêu cầu đối với SV: - Kiến thức thuật toán, lập trình."
    },
    {
        "id": 120,
        "Tên giảng viên": "Phạm Ngọc Hưng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển ứng dụng cho hệ thống IoT",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, KSCQ, SIE, KSTN, CTTT, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Phát triển các thành phần của hệ thống: Mobile App sử dụng React-Native, Back-end server sử dụng C# .Net Core hoặc NestJS Web front-end sử dụng ReactJS"
    },
    {
        "id": 120,
        "Tên giảng viên": "Ngô Thành Trung",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng của Đồ họa máy tính - Application of Computer Graphics",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Ảnh tạo bằng đồ họa máy tính ngày càng sát với thực tế. Nó mở ra rất nhiều ứng dụng như 1- Nghiên cứu tạo ra các loại hệ thống quang học tạo ảnh theo một đặc điểm riêng biệt, 2- Nghiên cứu thiết kế nhà cửa dưới ảnh hưởng của ánh sáng xung quanh. 3- Ước lượng, khôi phục đặc điểm quang học của vật liệu 4- Các bài toán kết xuất ngược (inverse rendering), biến ảnh 2D thành ảnh 3D. ... Ví dụ: https://ngottx.github.io/shape_reflectance.html"
    },
    {
        "id": 120,
        "Tên giảng viên": "Ngô Thành Trung",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Khôi phục ảnh 3 chiều sử dụng camera phân cực - 3D reconstruction with polarization camera",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, CNKT, KSCQ, KSTN, CTTT, CNKH, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Anh sáng thông thường đều có sự phân cực. Khi anh sáng tương tác với bề mặt vật chất sẽ bị thay đổi pha phân cực. Mắt người không nhận ra được sự thay đổi đó, nhưng một số động vật có khả năng này. Để trợ giúp con người, camera phân cực (polarization camera) có khả năng thu nhận được sự phân cực của ánh sáng. Sử dụng camera phân cực cho chúng ta thu nhận được nhiều thông tin hơn so với camera thông thường. Ví dụ có thể khôi phục ảnh 3D dễ dàng hơn, xóa bỏ những phản xạ không mong muốn trên bề mặt vật chất ( như trong các hệ thống trợ giúp quan sát mặt nước), phát hiện các lỗi sản phẩm.... Tham khảo: https://ngottx.github.io/shape_reflectance.html"
    },
    {
        "id": 120,
        "Tên giảng viên": "Ngô Thành Trung",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng của Machine Learning trong Computer Vision",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNKT, KSCQ, KSTN, CTTT, CNKH, KSCLC, CN, ThSKT, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Các ứng dụng của học máy trong Computer Vision. - Nhận dạng khuôn mặt, dáng đi. Các bài toán ứng dụng trong sinh trắc học và nhận dạng danh tính, giới tính, tuổi tác. - 3D reconstruction: khôi phục ảnh 3D của vật thể hay khung cảnh. Việc khôi phục ảnh 3D, bản đồ 3D có nhiều ứng dụng như các bài toán về tìm đường đi của robot, xe tự lái, - Nhận dạng hành vi, sự bất thường Ví dụ: https://ngottx.github.io/research.html"
    },
    {
        "id": 121,
        "Tên giảng viên": "Đinh Thị Hà Ly",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Radio resource optimization for next generation networks",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, KSTN, CTTT, Viet-Phap, KSCLC, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 121,
        "Tên giảng viên": "Đinh Thị Hà Ly",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Ứng dụng AI trong phát triển game",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 121,
        "Tên giảng viên": "Đinh Thị Hà Ly",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Đề tài tự chọn",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 121,
        "Tên giảng viên": "Nguyễn Đức Toàn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Trí tuệ nhân tạo ứng dụng",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Giải quyết các vấn đề, dự án thực tiễn bằng trí tuệ nhân tạo (học máy, học sâu, học tăng cường): + Phân tích tổng hợp thông tin, đưa ra các dự báo, hỗ trợ ra quyết định + Phát hiện các hành vi gian lận, giả mạo + Phân tích, xử lý dữ liệu lớn + Xây dựng các ứng dụng áp dụng trí tuệ nhân tạo"
    },
    {
        "id": 121,
        "Tên giảng viên": "Nguyễn Đức Toàn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng các phần mềm thông minh trên Smart phone có khả năng ứng dụng thực tiễn",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Xây dựng các ứng dụng mobile (native - Android, iOS, hybrid - Flutter, React Native,Ionic) + Ví dụ ứng dụng mobile: app đặt vé xem phim, app đặt xe (như grab), app quản lý kho + Ví dụ về ứng dụng có áp dụng trí tuệ nhân tạo: ứng dụng nhận diện biển xe (xe máy, ô tô), ứng dụng gợi ý / lập lịch làm việc"
    },
    {
        "id": 121,
        "Tên giảng viên": "Nguyễn Đức Toàn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "An toàn bảo mật thông tin",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "- Tìm hiểu và triển khai các giải pháp mã hóa và giải mã thông tin - Tìm hiểu nguyên lý hoạt động của mã độc để phát hiện và ngăn chặn/ loại trừ mã độc - Tìm hiểu các cơ chế tấn công mạng, đưa ra giải pháp phát hiện và ngăn chặn/ loại trừ tấn công - Xây dựng ứng dụng áp dụng công nghệ bảo mật (blockchain,..)"
    },
    {
        "id": 121,
        "Tên giảng viên": "Nguyễn Đức Toàn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Triển khai hệ thống, lập trình ứng dụng",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Lập trình ứng dụng Web, Mobile Xây dựng và triển khai hệ thống máy chủ, các hệ thống ảo hoá, các dịch vụ máy chủ, API"
    },
    {
        "id": 122,
        "Tên giảng viên": "Nguyễn Hồng Quang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện vi khuẩn nấm men nuôi cấy trong ảnh chụp từ kính hiển vi",
        "Loại đề tài": "Không xác định",
        "Hệ": "CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, KSCLC, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Nấm men thường được sử dụng trong công nghiệp thực phẩm như sản xuất bia, sữa chua... Mục đích của đề tài là phát hiện và đánh giá chất lượng của vi khuẩn nấm men trong quá trình nuôi cấy trong ảnh chụp từ kính hiển vị. Nghiên cứu này hợp tác với các nhà máy sản xuất bia, sữa chua."
    },
    {
        "id": 122,
        "Tên giảng viên": "Nguyễn Hồng Quang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Dự đoán tình trạng bệnh của bệnh nhân như dự đoán tiểu đường, đột quỵ, suy thận từ bản ghi EHR",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, SIE, KSTN, CTTT, Viet-Phap, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Dựa trên các bản ghi điện tử về của bệnh nhân, từ đó dự đoán tình trạng bệnh của bệnh nhân như dự đoán tiểu đường, đột quỵ, suy thận, ... Nghiên cứu này được thực hiện hợp tác với nhóm nghiên cứu của Victoria University of Wellington."
    },
    {
        "id": 122,
        "Tên giảng viên": "Nguyễn Hồng Quang",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xác định gen điều khiển từ dữ liệu giải trình tự đột biến gen của bệnh nhân ung thư",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, KSCQ, SIE, KSTN, CTTT, Viet-Phap, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Khối u phát triển do một số đột biến xảy ra trên các gen quan trọng. Nghiên cứu này nhằm phát hiện các gen này (được gọi là các gen điều khiển) từ dữ liệu thu được qua các xét nghiệm phát hiện đột biến gen của bệnh nhân ung thư. Nghiên cứu này được thực hiện hợp tác với các bác sỹ của Đại học Y Hà Nội (tập trung cho bệnh ung thư phổi)."
    },
    {
        "id": 122,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Xây dựng giải pháp quản lí mạng trong mạng thế hệ mới",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, KSCQ, SIE, KSTN, CTTT, Viet-Phap, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Việc quản lí mạng đóng vai trò quan trọng đối với các nhà mạng (Vietel, VNPT, v.v.). Một trong số đó là bài toán định tuyến nhằm tối ưu hiệu năng của hệ thống mạng về băng thông, độ mất mát gói tin. Tuy nhiên, các giải pháp truyền thống thông qua việc tìm đường đi ngắn nhất lại không hiệu quả, đặc biệt là trong mạng thế hệ mới như ngày nay. Mục tiêu của đồ án là xây dựng một thuật toán định tuyến nhằm tối ưu hiệu năng mạng trong mạng thế hệ mới. Thông qua đồ án này, sinh viên sẽ có thêm kiến thức và kĩ năng về mạng thế hệ mới (cấu hình, triển khai) cũng như các kĩ năng đọc báo cáo, làm việc nhóm. Ngoài ra sinh viên còn có cơ hội tham gia viết bài báo nghiên cứu khoa học nếu thu được kết quả tốt."
    },
    {
        "id": 123,
        "Tên giảng viên": "Tống Văn Vạn",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát hiện lỗ hổng trong smart contract của Blockchain sử dụng bytecode",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Nhắc tới tiền ảo thì chúng ta thường hay nghĩ tới Bitcoin hay Ether. Các loại tiền ảo này được tạo ra nhờ công nghệ Blockchain. Ngoài ứng dụng về tiền ảo, Blockchain còn có một ứng dụng nổi bật khác là smart contact, ứng dụng cung cấp các hợp đồng cho bên mua và bên bán mà không cần thông qua bên trung gian. Smart contract được viết bởi các ngôn ngữ lập trình (Solidity, Python, v.v) nên rất dễ tồn tại những lỗ hổng. Bên cạnh đó, người tham gia vào mạng Blockchain rất đa dạng nên sẽ có những kẻ xấu muốn lợi dụng lỗ hổng trong các smart contract để trục lợi. Ví dụ, Ethereum đã mất hơn 60 triệu đô la Mỹ năm 2016 vì bị kẻ xấu lợi dụng lỗ hổng reentrancy để trục lợi. Tương tự như vậy, trong năm 2017, một lỗ hổng khác bị khai thác làm cho Ethereum thiệt hại hơn 280 triệu đô la Mỹ. Vì vậy, việc phát hiện lỗ hổng trong smart contract đóng vai trò rất quan trọng tron Blockchain. Trong quá khứ, đã có rất nhiều công cụ phát hiện lỗ hổng trong smart contract được phát triển như Oyente, Mythril, Dedaub, v.v. Tuy nhiên, thời gian xử lí của các công cụ này lớn trong khi độ chính xác chưa được tốt. Do đó, rất nhiều nghiên cứu đã tập trung vào giải pháp phát hiện lỗ hổng tự động trong smart contract sử dụng bytecode của smart contract và thuật toán học sâu (Deep Learning). Trong một số trường hợp, mã nguồn của các smart contract không được công khai rộng rãi thì chúng ta có thể sử dụng bytecode được build từ mã nguồn, phân tích các bytecode này để trích rút ra các đặc trưng từ đó phân tích sử dụng thuật toán học sâu để tự động phát hiện các kiểu lỗ hổng. Mục tiêu của đồ án là xây dựng một giải pháp tự động phát hiện lỗ hổng cho các smart contract trong các sàn tiền ảo hay các ứng dụng triển khai dựa vào Blockchain. Thông qua đồ án này, sinh viên sẽ có thêm kiến thức và kĩ năng về thuật toán học sâu cũng như các kĩ năng đọc báo cáo, làm việc nhóm. Ngoài ra sinh viên còn có cơ hội tham gia viết bài báo nghiên cứu khoa học nếu thu được kết quả tốt."
    },
    {
        "id": 124,
        "Tên giảng viên": "Lê Xuân Thành",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nhận dạng cảm xúc tiếng nói bằng phương pháp học sâu",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Sử dụng bộ ngữ liệu tiếng nói có cảm xúc IEMOCAP Xây dựng các giải pháp nhận dạng cảm xúc được thể hiện trong bộ cảm xúc này bằng phương pháp học sâu SV thích machine learning, AI, lập trình được Python"
    },
    {
        "id": 124,
        "Tên giảng viên": "Lê Xuân Thành",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nhận diện mã độc bằng các kỹ thuật tiên tiến (học máy, mạng nơ-ron, AI...)",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Nghiên cứu các kỹ thuật nhận dạng mã độc trên máy tính và các thiết bị thông minh"
    },
    {
        "id": 124,
        "Tên giảng viên": "Lê Xuân Thành",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Mô hình dự đoán tương tác thuốc - cell line sử dụng metapath2vec",
        "Loại đề tài": "Không xác định",
        "Hệ": "ThSKH, CNTH, IPE, VB2, CNKT, KSCQ, SIE, KSTN, CTTT, CNKH, Viet-Phap, LATS, KSCLC, CN, ThSKT, VLVH, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Dựng lại model, sử dụng bộ dữ liệu sẵn có, hiệu chỉnh model để kết quả tốt hơn SV thích machine learning, AI, lập trình được Python"
    },
    {
        "id": 125,
        "Tên giảng viên": "Nguyễn Đức Tiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Thiết kế cân sức khỏe 4.0 và hệ thống dữ liệu",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Các chức năng chính: 1. cân: sử dụng 4 loadcell và module khuyêch đại. (được cung cấp mã nguồn và vật tư) 2. gửi về máy chủ. 3. hiển thị lên màn hình kết quả đo khối lượng 4. Hiển thị lên màn hình các kỷ lục của tháng, quí, năm, lượt đo thứ mấy trong ngày, 5. website hiển thị số liệu, đồ thị Từ khóa: MQTT, SIoT Core Lab, Web, ESP32, Loadcell Vật tư: được cung cấp tất cả linh kiện như ESP32, loadcell, mạch khuyêch đại, mã nguồn minh họa, module chuyển đổi điện áp 220V-5V, máy chủ web, cơ sở dữ liệu public. Đã hàn thành board hoàn chỉnh rồi. Dự kiến: đặt tại sảnh B1."
    },
    {
        "id": 125,
        "Tên giảng viên": "Nguyễn Đức Tiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Thiết bị giám sát trạng thái xoay của màn hình phụ máy tính",
        "Loại đề tài": "Không xác định",
        "Hệ": "VB2, CNKT, KSCQ, SIE, CTTT, Viet-Phap, CN, HEDSPI",
        "Số SV": "Không xác định",
        "Chi tiết": "Mô tả hiện trạng: - Một máy tính có thể kết nối với một màn hình phụ ở ngoài - Màn hình phụ có thể ở các vị trí khác nhau so mới màn hình máy tính chính - Màn hinh phụ có thể không ở phương ngang, mà xoay 90*, -90* để dựng đứng Vân đề: - Người dùng cần thiết lập lại vị trí của màn hình thứ 2 so với màn hinh chính để tiện di chuyển chuột Ý tưởng thực hiện: - Tạo ra một thiết bị phụ trợ để phát hiện được vị trí tương đối của màn hinh phụ so với màn hình chính, từ đó tự động cấu hình màn hình phụ cho hợp. Giải pháp: - Gắn một bộ điều khiển vào màn hình phụ, sử dụng ESP32 vì hỗ trợ WiFi, Bluetooth - Để đo góc nghiêng dùng 1 trong số các loại: cảm biến MPU9250, MPU6050, SW520, - ESP32 tự tạo thành bàn phím BLE-Keyboard để kết nối với máy tính. Mỗi khi thay đổi phương, ESP32 gửi tổ hợp Ctrl+Alt+Arrow để đổi phương. - Nếu lập trình để tạo một Agent trên máy tính, có thể dùng để chủ động thay đổi vị trí của màn hình phụ với màn hình chính. Tham khảo hàm win32 ChangeDisplaySettingsEx, hoặc của user32.sll là hàm ChangeDisplaySettings Hoặc sử dụng mã nguồn mở (đã test thành công, tạo lại Sign Key) https://www.codeproject.com/Articles/36664/Changing-Display-Settings-Programmatically - Tuy nhiên chưa có giải pháp để xác định màn hình phụ đặt ở bên trái, trên, hay bên phải của màn hình máy tính."
    },
    {
        "id": 125,
        "Tên giảng viên": "Nguyễn Đức Tiến",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Thiết bị nhắc hẹn",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Thiết bị nhắc đến lượt, tương tự như ở quán Cafe Highland - Thiết bị trung tâm phát tín hiệu báo + Module thu phát RF NRF24L01 có anten + nfc reader - Thiệt bị nhận tin hiệu với + motor rung: http://linhkiencuvn.com/motor-rung-0834-8-3-4mm-dc3v-5v + Module thu phát RF NRF24L01 + bộ xử lý trung tâm + nfc tag + pin"
    },
    {
        "id": 125,
        "Tên giảng viên": "Đỗ Tiến Dũng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Hệ nhúng và IoT (Embedded systems and internet of things)",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Tìm hiểu viết driver trên PI. Lập trình trên thiết bị arduino (vd đo thông số môi trường, điều khiển thiết bị). Lập trình thiết bị nhúng (vd hệ thống giám sát, quản lý thông minh)"
    },
    {
        "id": 125,
        "Tên giảng viên": "Đỗ Tiến Dũng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Thuật toán và quy trình phần mềm (Algorithm and software process)",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "(1) Nguyên cứu lý thuyết chủ đề thuật giải (Hash Table, Dynamic Programming, Depth-First and Breadth-First Search, Heap - Priority Queue, Graph), áp dụng, minh họa giải quyết các vấn đề liên quan. (2) Chọn một bài toán ứng dụng trong một lĩnh vực cụ thể. Xây dựng ứng dụng đảm bảo quy trình phát triển phần mềm (Requirement analysis, design, implementation, testing). Chạy chương trình với dữ liệu và tình huống thực tế."
    },
    {
        "id": 125,
        "Tên giảng viên": "Đỗ Tiến Dũng",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Bài toán luật kết hợp (Association rules)",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Tìm hiểu về bài toán khai phá luật kết hợp (Association rule mining). Luật kết hợp đối với dữ liệu lớn, luật kết hợp cho bài toán phân loại (Classification). Viết chương trình, minh họa trên các tập dữ liệu chuẩn (benchmark datasets) hoặc các dữ liệu thực tế khác."
    },
    {
        "id": 125,
        "Tên giảng viên": "Đặng Tuấn Linh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu mô hình đánh giá chất lượng hình ảnh",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 126,
        "Tên giảng viên": "Đặng Tuấn Linh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Phát triển module/ứng dụng giám sát thi cử dựa trên Open edX",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    },
    {
        "id": 126,
        "Tên giảng viên": "Đặng Tuấn Linh",
        "Khoa": "Khoa Kỹ thuật Máy tính",
        "Tên đề tài": "Nghiên cứu mô hình nhận dạng chữ viết tay/ chữ cái trên văn bản",
        "Loại đề tài": "Không xác định",
        "Hệ": "Không xác định",
        "Số SV": "Không xác định",
        "Chi tiết": "Không xác định"
    }
]